//操作符

//算数操作符 + - * /  (有一个是浮点数就是浮点运算) ； %（取余数/模）两端只能都是整数
//移位操作符 << >>
//位操作符 & ^ |
//赋值操作符 = += -= *= /= &= ^= |= >>= <<=
//单目操作符 ！反操作 - + &取地址 sizeof ～一个数的二进制位取反 -- ++ （）强制类型转换
//      eg：b=a++先使用后++ ，b=++a 先++后使用，int a= (int)3.14 强制转double为int
//关系操作符 > >= < <= !=判断不等 ==判断相等
//逻辑操作符 &&与 ||或 ！非
//条件操作符or三目操作符 a?b:c 若a真则表达b，若a假则表达c
//逗号表达式 从左向右依次执行 d=(c=a+2,a=b-c,c-3) 从左到右算完，最后一个式子的结果就是d的值
//下标引用[]引用数组，函数调用() Add(a,b)中Add,a,b都是操作数
//0为假 非零 为真
//关键字 一些词无法作为变量名
#include<stdio.h>
int main()
{
   
    return 0;
}